// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// let arr = [];
// arr[0] = 'start';
// arr[1] = 111111;
// arr[2] = 'text';
// arr[3] = 'array';
// arr[4] = 4455;
// arr[5] = true;
// console.log(arr)


// - Створити масив з будь-якою кількістю елементів різного типу (string, number, boolean) та

// let mas = ['Nadiia', 22, 'Kyiv', 'dog', 'IT', true, 555, false];

// - вивести в консоль лише цифри
// for (const ma of mas) {
//     if (typeof ma === 'number'){
//         console.log(ma);
//     }
// }
// - вивести в консоль лише стрічки, які мають 4 та більше символів.
// for (const ma of mas) {
//     if (typeof ma === 'string' && ma.length>=3){
//         console.log(ma);
//     }
// }
// - вивести лише булівські значення true
// for (const ma of mas) {
//     if (typeof ma === 'boolean'){
//         console.log(ma);
//     }
// }


// - Створити масив з 100 ітерацій, та вивести:

let arr100 = [];

// for (let i = 0; i < 100; i++) {
//     arr100.push(i);
// }
// console.log(arr100);

//     - кожен індекс
// for (let i = 0; i < 100; i++) {
//     arr100.push(i);
//     console.log(i);
// }


// - тільки парні індекси (2, 4, 6, 8 ...)
// for (let i = 0; i < 100; i++) {
//     arr100.push(i);
//     if (i % 2 === 0) {
//         console.log(i);
//     }
// }

// - індекси кратні 3 (3, 9, 12, 15 ...)
// for (let i = 0; i < 100; i++) {
//     arr100.push(i);
//     if (i % 3 === 0 && i>0) {
//         console.log(i);
//     }
// }





// - Дано масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()

// let it  = ['js', 'css', 'jq'];
// let firstEl = it.shift();
// console.log(firstEl);





// - Дано масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()

// let it2  = ['js', 'css', 'jq'];
// let lastEl = it2.pop();
// console.log(lastEl);





// - Дано масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
//     Підказка. Необхідно стерти елементи, зберегти їх кудись. Дописати букви і після букв повернути стерті цифри

// let arr1 = [1, 2, 3, 4, 5];
//
// let delEl1 = arr1.pop();
// let delEl2 = arr1.pop();
// arr1.push('a','b','c', delEl2, delEl1);
// console.log(arr1);





// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
//     Підказка. Працюйте по принципу задачі вище.

// let arr2 = [1, 2, 3, 4, 5];
//
// let delEl1 = arr2.pop();
// let delEl2 = arr2.pop();
// let delEl3 = arr2.pop();
// let delEl4 = arr2.pop();
// arr2.push('a','b', delEl4,delEl3,delEl2,'c',delEl1,'e');
// console.log(arr2);





// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//
//
// ============
//
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на ваше імя
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
// створити пустий масив та :
//     - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
//
//
// 1. Створити пустий масив та :
//     a. заповнити його 50 парними числами за допомоги циклу.
//     b. заповнити його 50 непарними числами за допомоги циклу.
//     c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)
// 2. Вивести за допомогою console.log кожен третій елемен
// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
// 5. Вивести кожен елемент масиву, сусід справа якого є парним
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
//
// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.
//
//
//
//
//     ______________________________________________________________________________________________________________________________________________________
// Додатково
// ______________________________________________________________________________________________________________________________________________________
//
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.